hedrickbt/TempSensor/Packages/.cache/Keil.STM32F7xx_DFP.2.6.0.pdsc
        <!-- *************************  Device 'STM32F746BG'  ***************************** -->
        <device Dname="STM32F746BG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746NG'  ***************************** -->
        <device Dname="STM32F746NG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746ZE'  ***************************** -->
        <device Dname="STM32F746ZE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746ZETx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F746ZEYx"> <feature type="CSP" n="143"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746VE'  ***************************** -->
        <device Dname="STM32F746VE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746VEHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F746VETx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746IE'  ***************************** -->
        <device Dname="STM32F746IE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F746IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746BE'  ***************************** -->
        <device Dname="STM32F746BE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746BETx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F746NE'  ***************************** -->
        <device Dname="STM32F746NE">
          <memory id="IROM1" start="0x08000000" size="0x80000"  startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x80000"  startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_512.FLM"        start="0x08000000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x80000"  RAMstart="0x20010000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F746NEHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F756'  **************************** -->
      <subFamily DsubFamily="STM32F756">
        <debug svd="CMSIS/SVD/STM32F7x6.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F756xx"/>
        <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
        <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
        <memory id="IRAM1" start="0x20010000" size="0x40000"     init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000"     init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"       start="0x08000000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="1" />
        <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"        start="0x00200000" size="0x100000" RAMstart="0x20010000" RAMsize="0x1000" default="0" />
        <book name="Documentation/DM00124865.pdf" title="STM32F74xx/5xx Reference Manual"/>
        <book name="Documentation/DM00166114.pdf" title="STM32F756 Data Sheet"/>

