hedrickbt/TempSensor/Packages/.cache/Keil.STM32F7xx_DFP.2.6.0.pdsc
        <!-- *************************  Device 'STM32F767VG'  ***************************** -->
        <device Dname="STM32F767VG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F768'  **************************** -->
      <subFamily DsubFamily="STM32F768">
        <debug svd="CMSIS/SVD/STM32F7x7.svd"/>
	    <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F767xx"/>
        <!--book name="Documentation/DM00124865.pdf" title="STM32F77xx/6xx Reference Manual"/-->
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F768AI'  ***************************** -->
        <device Dname="STM32F768AI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F768AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F769'  **************************** -->
      <subFamily DsubFamily="STM32F769">
        <debug svd="CMSIS/SVD/STM32F7x9.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F769xx"/>
        <memory id="IRAM1" start="0x20020000" size="0x60000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000"   init="0" default="1" />
        <!--book name="Documentation/DM00124865.pdf" title="STM32F77xx/6xx Reference Manual"/-->
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F769BI'  ***************************** -->
        <device Dname="STM32F769BI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769BG'  ***************************** -->
        <device Dname="STM32F769BG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769NI'  ***************************** -->
        <device Dname="STM32F769NI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769NG'  ***************************** -->
        <device Dname="STM32F769NG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769II'  ***************************** -->
        <device Dname="STM32F769II">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769IITx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769IG'  ***************************** -->
        <device Dname="STM32F769IG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769AI'  ***************************** -->
        <device Dname="STM32F769AI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F769AG'  ***************************** -->
        <device Dname="STM32F769AG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F769AGYx"> <feature type="CSP" n="180"/> </variant>
        </device>
     </subFamily>

