hedrickbt/TempSensor/Packages/.cache/Keil.STM32F7xx_DFP.2.6.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.3" condition="STM32F7 CMSIS_Driver SAI">
      <description>SAI Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI1                /* Driver SAI1 */
        #define RTE_Drivers_SAI2                /* Driver SAI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SAI_STM32F7xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="1.3" condition="STM32F7 CMSIS_Driver ETH_MAC">
      <description>Ethernet MAC Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/EMAC_STM32F7xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1" Cversion="1.4" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Device Full-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_FS_STM32F7xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="High-speed" Capiversion="2.1" Cversion="1.4" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Device High-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_HS_STM32F7xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="Full-speed" Capiversion="2.1" Cversion="1.6" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Host Full-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_FS_STM32F7xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="High-speed" Capiversion="2.1" Cversion="1.8" condition="STM32F7 CMSIS_Driver USB">
      <description>USB Host High-Speed Driver for STM32F7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS_STM32F7xx.c"/>
      </files>
    </component>

    <!-- STM32F746G-Discovery Board -->
    <bundle Cbundle="STM32F746G-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F746G-Discovery Kit</description>
      <doc>MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00190424.pdf</doc>
<!--
      <component Cgroup="Documentation" condition="STM32F7">
      <description>STM32F746G-Discovery BSP User Manual</description>
      <files>
        <file category="doc" name="Drivers/BSP/STM32746G-Discovery/STM32746G-Discovery_BSP_User_Manual.chm" />
      </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="Basic I/O" condition="STM32F746G-Discovery BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="STM32F746G-Discovery BSP Audio">
        <description>Audio for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera" condition="STM32F746G-Discovery BSP Camera">
        <description>Camera for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/ov9655/ov9655.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="STM32F746G-Discovery BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="STM32F746G-Discovery BSP LCD">
        <description>LCD for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_lcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI" condition="STM32F746G-Discovery BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="STM32F746G-Discovery BSP SD">
        <description>uSD for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM" condition="STM32F746G-Discovery BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="STM32F746G-Discovery BSP TS">
        <description>Touch Screen for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LED_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/Buttons_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32F746G-Discovery TS">
        <description>Touchscreen Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/Touch_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="STM32F746G-Discovery GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/GLCD_746G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="STM32F746G-Discovery LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LCD_X.c"/>
        </files>
      </component>
