hedrickbt/TempSensor/Packages/.cache/Keil.STM32F7xx_DFP.2.6.0.pdsc
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/ADC_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.00" condition="STM32756G-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Joystick_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32756G-EVAL TS">
        <description>Touchscreen Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Touch_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="STM32756G-EVAL GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/GLCD_756G_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="STM32756G-EVAL LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32756G-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.1" condition="STM32F7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/Audio_756G_EVAL.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32F746G-Discovery" Cvariant="RGB IF" Cversion="1.0.0" condition="STM32F7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32F746G-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F746G_Discovery/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Graphics Display" Cgroup="STM32756G-EVAL" Cvariant="RGB IF" Cversion="1.0.0" condition="STM32F7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32756G-EVAL LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32756G_EVAL/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <board vendor="STMicroelectronics" name="STM32F746G-Discovery" revision="Rev.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F746G_Discovery">
      <description>STMicroelectronics STM32F746G-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_small.jpg" large="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_large.jpg"/>
      <book category="setup"     name="Documentation/32F746GDISCOVERY_QSG.pdf" title="STM32F746G-Discovery Quick Start Guide"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF261641" title="STM32F746G_Discovery Web Page"/>
      <book category="manual"     name="Drivers/BSP/STM32746G-Discovery/STM32746G-Discovery_BSP_User_Manual.chm" title="BSP User Manual"/>
      <!-- <book category="setup"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00092826.pdf" title="Getting Started"/> -->
      <book category="schematic" name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00190424.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F746NGHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F746"/>
      <feature type="ODbg"      n="1"                name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="25000000"/>
      <feature type="RAM"       n="1"                name="128-Mbit SDRAM (64 Mbits accessible)"/>
      <feature type="ROM"       n="1"                name="128-Mbit Quad-SPI Flash memory"/>
      <feature type="MemCard"   n="1"                name="microSD card holder"/>
      <feature type="PWR"       n="5"                name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"         name="External Supply"/>
      <feature type="USB"       n="2"                name="USB OTG HS and FS with micro-AB Connector"/>
      <feature type="ETH"       n="1"  m="100000000" name="RJ54 Jack"/>
      <feature type="I2C"       n="1"                name="I2C extension connector"/>
      <feature type="Button"    n="2"                name="Push-buttons: User and Reset"/>
      <feature type="LineIn"    n="1"/>
      <feature type="LineOut"   n="1"/>
      <feature type="MIC"       n="2"                name="ST MEMS microphones"/>
      <feature type="ConnOther" n="1"                name="SPDIF RCA input connector"/>
      <feature type="Speaker"   n="2"/>
      <feature type="GLCD"      n="1" m="480.272"    name="Color TFT LCD with capacitive touch screen"/>
      <feature type="CustomFF"  n="80" m="130"       name="Discovery Board Formfactor"/>
      <feature type="ArduinoFF" n="1"                name="Arduino Uno 3V connectors"/>
      <feature type="Camera"    n="1"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
    <!-- STM32756G-EVAL -->
    <board vendor="STMicroelectronics" name="STM32756G-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32756G-EVAL2">
      <description>STMicroelectronics STM32756G-EVAL Evaluation Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_small.jpg" large="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF261640" title="STM32756G_EVAL Evaluation Board Web Page"/>
      <book category="setup"     name="Documentation/STM32F756G-EVAL_QSG.pdf" title="STM32F756G-Eval Quick Start Guide"/>
      <book category="manual"     name="Drivers/BSP/STM32756G_EVAL/STM32756G_EVAL_BSP_User_Manual.chm" title="BSP User Manual"/>
      <!-- <book category="setup"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/DM00092826.pdf" title="Getting Started"/> -->
      <book category="schematic" name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32756G_EVAL/Documentation/DM00188617.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32756G_EVAL/Documentation/stm327x6g-eval_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F756NGHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F756"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F746"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="RAM"       n="1"              name="8M x 32-bit SDRAM"/>
      <feature type="RAM"       n="1"              name="1M x 16-bit SRAM"/>
      <feature type="ROM"       n="1"              name="8M x 16-bit Nor Flash"/>
      <feature type="USB"       n="1"              name="High-Speed USB with micro-AB Connector"/>
      <feature type="USB"       n="2"              name="Full-Speed USB with micro-AB Connector"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="Camera"    n="1"/>
      <feature type="Button"    n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"       n="4"              name="4 color LEDs directly connected to port pins"/>
      <feature type="GLCD"      n="1"  m="640.480" name="5.7 inch Color TFT color LCD with capacitive touch panel"/>
      <feature type="Poti"      n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"    n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"   n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="MIC"       n="2"                name="ST MEMS microphones"/>
      <feature type="Speaker"   n="2"/>
      <feature type="Other"     n="1"              name="Digital Steroe Microphone"/>
      <feature type="CAN"       n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="ETH"       n="1"              name="10/100 Ethernet Port"/>
      <feature type="XTAL"      n="32000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="DIO"       n="34"             name="Motor Control Connector"/>
      <feature type="DIO"       n="56"             name="Daughterboard Extension header 1"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 2"/>
      <feature type="ConnOther" n="1"              name="Motor control connector"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32F746G-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky with STM32CubeMX" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/CubeMX/Blinky">
      <description>CMSIS-RTOS based Blinky example configured with STM32CubeMX</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

